Revit 2022 API
FabricationService.IsValidGroupIndex Method
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `IsValidPaletteIndex` method instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute]
public bool IsValidGroupIndex(
	int groupIndex
)
Visual Basic
<ObsoleteAttribute> _
Public Function IsValidGroupIndex ( _
	groupIndex As Integer _
) As Boolean
Visual C++
[ObsoleteAttribute]
public:
bool IsValidGroupIndex(
	int groupIndex
)
Parameters
groupIndex
Type: System.Int32
 The group index to check.
Return Value
 True if larger or equal to 0 and less than GroupCount.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace